[
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 0,
    "page": 2,
    "text": "2 1. Introduction to Physics  3 1. Introduction to Physics 2. Quantities and Measurement in Physics 0 Quantities, Units, Dimensional analysis 0 Number notation 0 Estimates and Order-of-magnitude calculations 0 Uncertainty, significant figures 3. Model Building 4. Vectors What is Physics for? 0 To find the limited number of fundamental laws that govern natural phenomena. “Everything should be made as simple as possible, but not simpler.” --- Albert Einstein Unified field theory? 0 To use these"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 1,
    "page": 2,
    "text": "Einstein Unified field theory? 0 To use these laws to develop theories that can predict the results of future experiments. 0 Express the laws in the language of mathematics.  4"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 2,
    "page": 3,
    "text": "3 The goal of Physics is to find the mechanisms and equations that can describe the Nature. For example,  5 ) Elect C rod c yn m am h i i c s s : lassi al ec an c : Thermodynamics: e.g., (state of equation) Quantum mechanics: Maxwell's e e quations (Schroding r eq. F ma PV nRT H i t          What does Physics have? 0 Classical physics (before 1900) 0 Modern physics (after 1900)  6"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 3,
    "page": 4,
    "text": "4 Classical Physics 0 Classical Mechanics Major developments by Newton, and continuing through the latter part of the 19th century. 0 Thermodynamics 0 Optics 0 Electromagnetism All of these were not developed well until the latter part of the 19th century.  7 Modern Physics 0 Began near the end of the 19th century 0 Phenomena that could not be explained by classical physics 0 Includes theories of relativity and quantum mechanics  8 Range of validity!"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 4,
    "page": 5,
    "text": "5 Evolution of Science 0 Experimental observation explained by theory 0 Theoretical predication verified by experiment 0 Some statistical phenomena (經驗法則), no theory to predict or explain. (e.g., 80/20 rule)  9 Physics is an experimental science.  10 0 5 10 15 20 25 30 35 0 10 20 30 40 50 60 70 Lecture # Attendance 2017 Fall Pysics (I) 0 5 10 15 20 25 30 35 0 10 20 30 40 50 60 70 Lecture # Attendance 2018 Spring Pysics (II)"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 5,
    "page": 5,
    "text": "6 2. Quantities and Measurement in Physics  11 1. Introduction to Physics 2. Quantities and Measurement in Physics 0 Quantities, Units, Dimensional analysis 0 Number notation 0 Estimates and Order-of-magnitude calculations 0 Uncertainty, significant figures 3. Model Building 4. Vectors Physical Quantities 0 In mechanics, three fundamental quantities are used  Length  Mass  Time 0 Will also use derived quantities  These are other quantities can be expressed in terms of these. e.g.,"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 6,
    "page": 5,
    "text": "can be expressed in terms of these. e.g., velocity=length/time  12"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 7,
    "page": 7,
    "text": "7 Standards of Quantities 0 “Standard” Universal, reproducible, not changing with time. 0 SI – Systéme International (metric system)  13 Charge is not a base unit! (Bauer/Westfall, University Physics with Modern Physics) Base Units  14"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 8,
    "page": 8,
    "text": "8  15 “Guide for teachers and students to explain the new kg” Wolfgang Ketterle, Alan Jamison, MIT https://www.rle.mit.edu/cua_pub/ketterle_group/The%20new%20kg/Kilogram%2 0for%20students%20and%20teachers.pdf Cs 2 h m c   New Definition of kg Old kg (Pt-Ir alloy) Conversion of Units 0 Units can be treated like algebraic quantities that can cancel each other out. e.g., 1 inch = 2.54 cm 15.0 in = (15.0 in)(2.54 cm/in) = 38.1 cm  16"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 9,
    "page": 8,
    "text": "9 Dimensional Analysis 0 Dimension specifies the physical nature of a quantity. Length [L], Mass [M], Time [T] Can be treated as algebraic quantities. 0 Dimensional analysis is to check the correctness of an equation or to assist in deriving an equation. Both sides of equation must have the same dimensions. E.g., 1 , ? 2 n S at n   2 [ ] [ / ][ ] n L L T T  2 n    17 Number Notation 0 When writing out numbers with many digits, spacing in groups of three will be used. No commas, e.g., 25"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 10,
    "page": 8,
    "text": "groups of three will be used. No commas, e.g., 25 100 5.123 456 789 12  18"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 11,
    "page": 10,
    "text": "10 Powers of ten 0 Examples: 1 mm =  m 1 mg =  g  19 Scientific notation : M x 10n  20"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 12,
    "page": 10,
    "text": "11 Estimates and Order-of-Magnitude Calculations 0 Approximation based on a number of assumptions. 0 Expressed in scientific notation : M x 10n 0 Order of magnitude is the power of 10 that applies e.g., set to 1 10 3.162 3.16 set to 2 10 M M M M      3 ~ 10 3 0.0086 8.6 10   2 10  3 0.0021 2.1 10   3 ~10 2 720 7.2 10   Back-of-the-envelope calculation!  21 Ex. Estimate the number of breaths in a human lifetime Number of breaths per minute: ~ 10 breaths/min Lifetime: ~ 70 yr 365"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 13,
    "page": 10,
    "text": "minute: ~ 10 breaths/min Lifetime: ~ 70 yr 365 days 24 hr 60 min 70 yr yr day hr  400 25 5 7 (70 yr)(6 10 min/yr) 4 10 min     Total breaths: ~ (10 breaths/min)(4x107 min)=4x108 breaths  22"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 14,
    "page": 12,
    "text": "12 Ex. Estimate the number of Stars in the Milky Way ? Facts: 1. The Milky Way galaxy is roughly a disk of diameter ~1021 m and thickness ~ 1019 m . 2. The distance between Sun and nearest Star is 4 x 1016 m. Assume 4 x 1016 m is a typical distance between stars.   2 21 19 61 3 10 Galaxy volu m 10 m 10 m me:    3 16 49 3 4 Volume for findi 1 4 0 ng a star m ~10 m 3 2 :        61 49 12 Number of stars: 10 /10 10    23 Uncertainty (error) in Measurements 0 There is uncertainty in"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 15,
    "page": 12,
    "text": "(error) in Measurements 0 There is uncertainty in every measurement - this uncertainty carries over through the calculations. 0 Absolute uncertainty 0 Percent uncertainty 0 Propagation of Uncertainty (See Serway, Appendices-20)   e.g., 5.5 cm or 5.5(1) cm 0.1  0.1 0.18% 5.5 e.g., 5.5 cm (5.5 )cm           24"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 16,
    "page": 13,
    "text": "13 Significant Figures 0 A significant figure is one that is reliably known in a measurement. 0 The significant figures include the first estimated digit. 0 Zeros may or may not be significant. Those used to position the decimal point are not significant To remove ambiguity, use scientific notation.  25 Significant Figures, examples 0 “0.0075 m” has 2 significant figures. The leading zeros are placeholders only. Can write in scientific notation 7.5 x  m for 2 significant figures. 0 “10.0 m” has"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 17,
    "page": 13,
    "text": "x  m for 2 significant figures. 0 “10.0 m” has 3 significant figures. The decimal point gives information about the reliability of the measurement. 0 “1500 m” is ambiguous. Use 1.5 x 103 m for 2 significant figures. Use 1.50 x 103 m for 3 significant figures. Use 1.500 x 103 m for 4 significant figures.  26"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 18,
    "page": 14,
    "text": "14 Operations with Significant Figures – Adding or Subtracting 0 When adding or subtracting, the number of decimal places in the result should equal the smallest number of decimal places in any term in the sum. Example: 135 cm + 3.25 cm = 138 cm  27 Operations with Significant Figures – Multiplying or Dividing 0 When multiplying or dividing, the number of significant figures in the final answer is the same as the number of significant figures in the quantity having the lowest number of"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 19,
    "page": 14,
    "text": "in the quantity having the lowest number of significant figures. Example: 25.57 m x 2.45 m = (62.6465)m2 = 62.6 m2 5.1 x 2 x 9.3 = (94.86) = 9 x 101 (4) (3) (3) (2) (1) (2) (1)  28"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 20,
    "page": 15,
    "text": "15 3. Model building  29 1. Introduction to Physics 2. Quantities and Measurement in Physics 0 Quantities, Units, Dimensional analysis 0 Number notation 0 Estimates and Order-of-magnitude calculations 0 Uncertainty, significant figures 3. Model Building 4. Vectors Model Building 0 If physicists cannot interact with some phenomenon directly, they often imagine a model for a physical system that is related to the phenomenon, and make predictions about the behavior of the system. Geometric model"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 21,
    "page": 15,
    "text": "about the behavior of the system. Geometric model (e.g., geometric construction of star’s size and distance) Simplification model (e.g., uniform, isotropic, symmetry, resistance- free, …) Analysis model (e.g., particle, system, rigid object, wave) Structural model (e.g., atomic model, standard model, Drude model)  30"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 22,
    "page": 16,
    "text": "16 4. Vectors  31 1. Introduction to Physics 2. Quantities and Measurement in Physics 0 Quantities, Units, Dimensional analysis 0 Number notation 0 Estimates and Order-of-magnitude calculations 0 Uncertainty, significant figures 3. Model Building 4. Vectors Coordinates Expressions Unit vectors Cartesian (rectangular) Polar Cylindrical Spherical Coordinate Systems ( , , ) x y z ( , ) r  ( , , ) r z  ( , , ) r   32 Rectangular coordinate ˆ ˆ x y A A i A j    ˆr ˆ ˆ A rr   Polar"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 23,
    "page": 16,
    "text": "ˆ ˆ x y A A i A j    ˆr ˆ ˆ A rr   Polar coordinate ˆ ˆ ˆ , , i j k ˆ ˆ,r  ˆ ˆ ˆ , , r z  ˆ ˆ ˆ, , r "
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 24,
    "page": 17,
    "text": "17  33 a b 2 2 2 2 1 x y a b    x y x y 2 2 1 px qy rxy    Ex. Proper choice of the coordinates can simplify the calculation.  34 on 2 2 2 2 2 2 0 2 0 ˆ ˆ ˆ 1 ( ) 4 ( ) 1 4 ˆ q r Qq xx yy zz F r x y z x y z Qq r             Q q  in spherical coordinate in Cartesian coordinate Ex."
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 25,
    "page": 18,
    "text": "18 Transformation between polar and Cartesian coordinates x = r cos θ y = r sin θ 2 2 1 tan r x y y x      x r y          35 ˆ r rr    ˆ ˆ rr    ˆr ˆ Equality of Two Vectors 0 Two vectors are equal if they have the same magnitude and the same direction. 0 A = B if A = B and they point along parallel lines. 0 All of the vectors shown are equal.  36"
  },
  {
    "source": "Lec01.txt",
    "category": "Physics",
    "chunk_index": 26,
    "page": 19,
    "text": "19 Vector addition  37 Vector subtraction Operations on Vectors  38 Scalar product Vector product cos x x y y z z A B AB A B A B A B        ˆ ˆ ˆ sin x y z x y z i j k A B A A A B B B A B AB         \n\n20 Solving vector problems 0 Graphical method e.g., scale drawings 0 Algebraic Method e.g., Trigonometry  39 ˆ ˆ ( ) ( ) ˆ ˆ cos sin x x y y R A B i A B j R i R j          2 2 ( ) ( ) x x y y R A B A B     tan y y x x A B A B    "
  }
]