[
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 0,
    "page": 2,
    "text": "2 Outline 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer \u0006 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0007 1. Temperature and Zeroth law of thermodynamics \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 1,
    "page": 3,
    "text": "3 Thermal Contact \u0001 Two objects are in thermal contact with each other if energy can be exchanged between them. The exchanges we will focus on will be in the form of heat or electromagnetic radiation. The energy is exchanged due to a temperature difference. \b \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Thermal Equilibrium \u0001 Thermal equilibrium is a situation in which two objects would have no net exchange of energy by heat or electromagnetic radiation if they were placed in thermal contact. \u0001 The thermal contact does not have"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 2,
    "page": 3,
    "text": "contact. \u0001 The thermal contact does not have to be physical contact. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 3,
    "page": 4,
    "text": "4 Zeroth Law of Thermodynamics – the Law of Equilibrium \u0001 If objects A and B are separately in thermal equilibrium with a third object C, then A and B are in thermal equilibrium with each other. \u0001 Two systems are in thermal equilibrium if and only if they have the same temperature. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Temperature \u0001 Temperature can be thought of as the property that determines whether an object is in thermal equilibrium with other objects . \u0001 Two objects in thermal equilibrium with each other are at the"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 4,
    "page": 4,
    "text": "in thermal equilibrium with each other are at the same temperature. \u0001 Can a particle such as an electron have any temperature ? No. Temperature is meaningless for a one-particle system. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 5,
    "page": 5,
    "text": "5 Q: Two objects, with different sizes, masses, and temperatures, are placed in thermal contact. Energy travels (a) from the larger object to the smaller object (b) from the object with more mass to the one with less (c) from the object at higher temperature to the object at lower temperature. A: (c) \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0005\u0001 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 6,
    "page": 5,
    "text": "and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer 2. Thermometers and Temperature Scales"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 7,
    "page": 6,
    "text": "6 Thermometers \u0001 A thermometer is a device that is used to measure the temperature of a system. \u0001 Thermometers are based on the principle that some physical property of a system changes as the system’s temperature changes. The volume of a liquid. The dimensions of a solid. The pressure of a gas at a constant volume. The volume of a gas at a constant pressure. The electric resistance of a conductor. The color of an object. The thermal radiation. \u0005\u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0005\u0003"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 8,
    "page": 6,
    "text": "7 Celsius Temperature Scale (centigrade) \u0001 The ice point of water is defined to be 0o C. \u0001 The steam point of water is defined to be 100o C. \u0001 The length between these two points is divided into 100 increments, called degrees. \u0005\u0006 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Fahrenheit temperature scale \u0001 The ice point of water is defined to be 32o F. \u0001 The steam point of water is defined to be 212o F. \u0001 The length between these two points is divided into 180 increments: \u0001 TF = 100 o F, when TC = 38 o C. \u0005\u0007 F C 9 32 5 T T F  "
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 9,
    "page": 6,
    "text": "o F, when TC = 38 o C. \u0005\u0007 F C 9 32 5 T T F    \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 10,
    "page": 8,
    "text": "8 The Constant Volume Gas Thermometer \u0005\b Absolute zero \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Absolute Temperature Scale \u0001 Absolute zero is used as the basis of the absolute temperature scale. TCelsius = T – 273.15. The unit of the absolute is kelvin. \u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 The temperature for the triple point of water is 273.16 K.\n\n9 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0005 \u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 11,
    "page": 8,
    "text": "10 \u0005 3. Thermal expansion of Solids and Liquids \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer Thermal Expansion \u0001 Thermal expansion is the increase in the size of an object with an increase in its temperature. \u0001 Thermal expansion is a consequence of the change in the average separation between the atoms in an object. \u0003\u0001"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 12,
    "page": 8,
    "text": "separation between the atoms in an object. \u0003\u0001 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 13,
    "page": 11,
    "text": "11 \u0003\u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Linear Expansion \u0001 Assume an object has an initial length Li. \u0001 That length increases by L as the temperature changes by T. \u0001 We define the coefficient of linear expansion as L = LiT, unit: (oC)-1. α depends on temperature. The linear relation is only good for a small temperature range. only for solids and liquids. \u0003\u0003 / i L L T     \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 14,
    "page": 11,
    "text": "12 \u0001 Some materials expand along one dimension, but contract along another as the temperature increases, is not always positive. e.g., CaCO3, rubber, heat shrink tube. \u0003\u0006 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0003\u0007 Thermal (1) i L T L          Tension / / (2) Young's modulus / i i F A F A Y Y L L L L              Thermal stres : s F T Y A    \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Thermal stress induced by temperature change If the total length is kept fixed, Thermal Tension 0 i i L L L L                "
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 15,
    "page": 13,
    "text": "13 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0003\b https://www.facebook.com/theactionlabofficial/videos/30 8285330859254 Volume Expansion \u0001 The change in volume is proportional to the original volume and to the change in temperature. V = Vi T. is the coefficient of volume expansion. \u0001 For a solid, 3assuming the material is isotropic. \u0003 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 16,
    "page": 13,
    "text": "14 \u0003 Proof: ( )( )( ) i i i i V V l l w w h h          ( )( )( ) i i i i i i l l T w w T h h T         3 (1 ) i i i l w h T    2 3 1 3 3( ) ( ) iV T T T             3 3( i V T T V         2 1 ) ( T T       3 1 ) T    \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Q: Two spheres are made of the same metal and have the same radius, but one is hollow and the other is solid. The spheres are taken through the same temperature increase. Which sphere expands more? (a) solid"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 17,
    "page": 13,
    "text": "increase. Which sphere expands more? (a) solid sphere. (b) hollow sphere. (c) They expand by the same amount. (d) not enough information to say. A: (c) \u0003 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 18,
    "page": 15,
    "text": "15 \u0003 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 The unusual behavior of water \u0001 As the temperature decreases from 4oC to 0oC, water volume expands and its density decreases. Cold water and ice float on top and warm water stays at the bottom. \u0001 Above 4oC, water expands with increasing temperature, and its density decreases. \u0001 The maximum density of water (1.000 g/cm3) occurs at 4oC. \u0006\u0001 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 19,
    "page": 16,
    "text": "16 \u0006\u0005 It explains why ice floats on water. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0006\u0003 4. Heat \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 20,
    "page": 16,
    "text": "17 Heat \u0001 Heat (Q) is defined as the transfer of energy across the boundary of a system due to a temperature. difference between the system and its surroundings. \u0001 The term heat will also be used to represent the amount of energy transferred by this method. \u0006\u0006 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Units of Heat \u0001 The calorie is the unit used for heat. One calorie is the amount of energy transfer necessary to raise the temperature of 1 g of water from 14.5oC to 15.5oC. \u0001 In the US Customary system, the unit is a BTU"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 21,
    "page": 16,
    "text": "\u0001 In the US Customary system, the unit is a BTU (British Thermal Unit). One BTU is the amount of energy transfer necessary to raise the temperature of 1 lb of water from 63oF to 64oF. \u0001 The SI unit is to use Joules. 1 cal = 4.186 J 1BTU = 1055 J \u0006\u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 22,
    "page": 18,
    "text": "18 Mechanical Equivalent of Heat \u0001 Joule established the equivalence between mechanical energy and internal energy. \u0001 The loss in potential energy associated with the blocks equals the work done by the paddle wheel on the water. \u0006\b \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Heat Capacity \u0001 The heat capacity, C, of a particular sample is defined as the amount of energy needed to raise the temperature of that sample by 1oC. \u0001 If energy Q only produces a change of temperature of T and does NOT convert into other energy such as"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 23,
    "page": 18,
    "text": "T and does NOT convert into other energy such as work and potential energy, then \u0006 . Q C T   \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 24,
    "page": 19,
    "text": "19 Specific Heat \u0001 Specific heat, c, is the heat capacity per unit mass. \u0001 If energy Q transfers to a sample of a substance of mass m and the temperature changes by T, then the specific heat is \u0006 C Q c m m T    \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0006 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 25,
    "page": 20,
    "text": "20 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0006 Molar specific heat : molar specific heat : number of moles n n Q T n c c n   , : molar mass m n M M  n n m Q T Mc T c M mc c           \u0007\u0001 5. Calorimetry and Phase Changes \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 26,
    "page": 20,
    "text": "21 Calorimetry \u0001 Conservation of energy requires that the amount of energy that leaves the sample equals the amount of energy that enters the water Qcold= Qhot \u0007\u0005 ( ) ( ) w w w x f x x f m c T m c T T T     ) ( ( ) w w f w x x x f m c T T c m T T     \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Phase Changes \u0001 A phase change is when a substance changes from one form to another. \u0001 Two common phase changes are Solid to liquid (melting). Liquid to gas (boiling). \u0001 Certain phase changes involve a change in internal energy"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 27,
    "page": 20,
    "text": "phase changes involve a change in internal energy but there is no change in temperature of the substance. \u0007\u0003 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 28,
    "page": 22,
    "text": "22 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0007\u0006 Latent Heat \u0001 If an amount of energy Q is required to change the phase of a sample of mass m, Q = mL The quantity L is called the latent heat of the material. \u0007\u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 29,
    "page": 23,
    "text": "23 \u0007\b Potential energy Phase transition, l n int e Kinetic energy T mperatur t e ate hea t thermal energy + Bond energy E      \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 int 1 ( ) 2 n L n R T f E      \u0001 The latent heat of fusion/solidification is used when the phase change is between solid and liquid. \u0001 The latent heat of vaporization/condensation is used when the phase change is from liquid to gas. \u0001 The latent heat of vaporization is greater than the latent heat of fusion. \u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 30,
    "page": 24,
    "text": "24 Sample Latent Heat Values \u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005Latent heat is not correlated with the melting point and boiling point. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0007 https://www.youtube.com/watch?v=-SGscd2KIjE The metal gallium has a low melting temperature 29.8 C."
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 31,
    "page": 24,
    "text": "25 Supercooling and superheating \u0001 If liquid water is held perfectly still in a very clean container, it is possible for the water to drop below 0˚C without freezing into ice. This phenomenon, called supercooling. If supercooled water is disturbed, it suddenly freezes. The system drops into the lower-energy configuration of bound molecules of the ice structure, and the energy released raises the temperature back to 0˚C. Commercial Hand warmers are an example. \u0001 It is also possible to create"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 32,
    "page": 24,
    "text": "are an example. \u0001 It is also possible to create superheating. For example, clean water in a very clean cup placed in a microwave oven can sometimes rise in temperature beyond 100˚C without boiling because the formation of a bubble of steam in the water requires scratches in the cup or some type of impurity in the water to serve as a nucleation site. \u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \b\u0001 https://www.youtube.com/watch?v=NMSxuORKynI https://www.youtube.com/watch?v=ph8xusY3GTM \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 33,
    "page": 24,
    "text": "\u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 https://www.facebook.com/watch/?v=1799173086925334"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 34,
    "page": 26,
    "text": "26 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \b\u0005 http://www.chemistry-blog.com//chemistry-lab-demonstrations- liquid-co2-extraction/ https://www.youtube.com/watch?v=GEr3NxsPTOA&t=108s Supercritical fluid – CO2 \b\u0003 4 2.09 10 J v E mL     \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Ex. Liquid helium has a very low boiling point, 4.2 K, and a very low latent heat of vaporization, 2.09 × 104 J/kg. If energy is transferred to a container of boiling liquid helium from an immersed electric heater at a rate of 10.0 W, how long does it take to boil away 1.00 kg"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 35,
    "page": 26,
    "text": "W, how long does it take to boil away 1.00 kg of the liquid? 4 2.09 10 J/kg vL   Ans: 4 3 2.09 10 J 2.09 10 s 10.0 J/s E t P      "
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 36,
    "page": 27,
    "text": "27 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \b\u0006 Ex. A heavy copper pot of mass 2.0 kg (including the copper lid) is at a temperature of l50 ˚C. You pour 0.10 kg of water at 25 ˚C into the pot, then quickly close the lid of the pot so that no steam can escape. Find the final temperature of the pot and its contents, and determine the phase (liquid or gas) of the water. Assume that no heat is lost to the surroundings. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \b\u0007 Ans: 3 possible outcomes: 1. Tf < 100 ˚C, liquid 2. Tf = 100 ˚C, liquid + steam 3. Tf ≥100 ˚C,"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 37,
    "page": 27,
    "text": "2. Tf = 100 ˚C, liquid + steam 3. Tf ≥100 ˚C, steam"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 38,
    "page": 28,
    "text": "28 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \b\b 2 2 2 ( 25) ( 150) 0 106 100, violates the premise. H O Cu H O H O f Cu Cu f f Q Q m c T m c T T          Case 1: Case 2:   2 2 2 2 (100 25) (100 150) 0.034 1, acceptible solution. If 1, then continue to try Case 3! H O Cu H O H O H O Cu Cu Q Q m c m L m c x x x               \b 6. Mechanisms of Heat Transfer \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1. Temperature and the Zeroth Law of Thermodynamics 2. Thermometers and Temperature scales 3. Thermal Expansion of Solids and Liquids 4."
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 39,
    "page": 28,
    "text": "3. Thermal Expansion of Solids and Liquids 4. Heat 5. Calorimetry and Phase Changes 6. Mechanisms of Heat Transfer"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 40,
    "page": 29,
    "text": "29 Mechanisms of Heat Transfer \u0001 Conduction \u0001 Convection \u0001 Radiation \b \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Conduction \u0001 The thermal conduction process can be viewed on an atomic scale, as an exchange of kinetic energy between microscopic particles by collisions. The microscopic particles can be atoms, molecules or free electrons. Rate of conduction depends upon the characteristics of the substance. \b \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 41,
    "page": 30,
    "text": "30 \u0001 In general, metals are good conductors. They contain large numbers of electrons that are relatively free to move through the metal. Poor conductors include asbestos, paper, and gases. \u0001 Conduction can occur only if there is a difference in temperature between two parts of the conducting medium. \b \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Law of thermal conduction \u0001 The rate of transfer P is given by: \u0001 Q P t  T A x    dT P kA dx   : thermal conductivity : temperature gradient k dT dx \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 42,
    "page": 31,
    "text": "31 Temperature Gradient \u0005 For a steady state and k is independent of temperature, h c T T dT dx L    \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0003 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 43,
    "page": 31,
    "text": "32 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0006 Ex. Energy Transfer Through Two Slabs Two slabs of thickness L1 and L2 and thermal conductivities k₁ and k2 are in thermal contact with each other, as shown in Figure. The temperatures of their outer surfaces are Tc and Th, respectively, and Th> Tc. Determine the temperature at the interface and the rate of energy transfer by conduction through the slabs in the steady-state condition. 1k 1k 2k 2k T 1L 2 L 1 2 A A A   1 2 L L L   \u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1 2 1 2 1 2 1 2 h c h c P L T T T"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 44,
    "page": 31,
    "text": " \u0007 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 1 2 1 2 1 2 1 2 h c h c P L T T T T k A k A A L L L T P P T k                            1 2 2 1 1 2 2 1 c h k L T k LT k L k L T     1 1 2 2 ( ) ( / ) ( / ) h c P A T T L k L k    1 2 1 1 2 2 ( / ) ( / ) L L L k L k k    Ans: (a)"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 45,
    "page": 33,
    "text": "33 \b \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 (b) 1 2 P P P   1 1 2 2 h c h c h c k T T T T T T A k A k A L L L                         1 1 2 2 A k A A k k    Convection \u0001 Energy transferred by the movement of a substance. When the movement results from differences in density, it is called natural convection. When the movement is forced by a fan or a pump, it is called forced convection. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 46,
    "page": 33,
    "text": "34 Radiation emission \u0001 All objects radiate energy continuously in the form of electromagnetic waves due to thermal vibrations of their molecules. \u0001 Rate of radiation is given by Stefan’s law: P = σAeT 4 P is the rate of energy transfer, in Watts. σ = 5.6696 x  W/m2 . K4. A is the surface area of the object. e is a constant called the emissivity. e varies from 0 to 1. T is the temperature in Kelvins. \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Radiation absorption In equilibrium, the power of emission = the power of"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 47,
    "page": 33,
    "text": "equilibrium, the power of emission = the power of absorption, 4 absorption emission P P AeT   "
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 48,
    "page": 35,
    "text": "35 Energy Absorption and Emission by Radiation \u0001 With its surroundings, the rate at which the object at temperature T with surroundings at To radiates is Pnet = σAe (T 4 –To 4). \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Ideal Absorbers/ Ideal Reflector \u0001 An ideal absorber is defined as an object that absorbs all of the energy incident on it. e = 1. This type of object is called a black body. An ideal absorber is also an ideal radiator of energy. \u0001 An ideal reflector absorbs none of the energy incident on it. e = 0 \u0001"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 49,
    "page": 35,
    "text": "none of the energy incident on it. e = 0 \u0001 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 50,
    "page": 36,
    "text": "36 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0005 \u0003 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 Ex. A student is trying to decide what to wear. The surroundings (his bedroom) are at 20.0 ˚C. If the skin temperature of the unclothed student is 35 ˚C, what is the net energy loss from his body in 10.0 min by radiation? Assume that the emissivity of skin is 0.900 and that the surface area of the student is 1.50 m². 4 4 0 8 2 4 2 4 4 ( ) 5.67 10 W/m )(1.5 m ) 0.9 [(308 K) (293 K) ] 125 W net P Ae T T K            Ans: 4 (125 W)(600 s) 7.5 10 J net Q P t"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 51,
    "page": 36,
    "text": "    Ans: 4 (125 W)(600 s) 7.5 10 J net Q P t    "
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 52,
    "page": 37,
    "text": "37 The Dewar Flask \u0001 A Dewar flask is a container designed to minimize the energy losses by conduction, convection, and radiation. \u0001 A Thermos bottle is a common household equivalent of a Dewar flask. \u0006 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \u0007 超導磁鐵 Dewar radiation baffle \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005\n\n38 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 \b https://www.facebook.com/watch/?ref=saved&v=1369 992506854607 \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005 一碗冰淇淋惹出的大麻煩！熱水結冰比冷水快？半 世紀爭議終於解開 [https://pansci.asia/archives/190853] Mpemba effect"
  },
  {
    "source": "Lec17.txt",
    "category": "Physics",
    "chunk_index": 53,
    "page": 39,
    "text": "39 https://physicstoday.scitation.org/do/10.1063/PT.6.1.20191217a/full/ \u0003\u0001\u0003\u0003\u0004\u0005\u0003\u0004\u0006\u0005"
  }
]